# Codio Coding Assignment 3.1: Pandas Foundations, Data Cleaning, and Manipulation

### Learning Outcomes Addressed

- 2. Implement pandas *series* and *dataframes*.
- 3. Perform data cleaning in pandas.
- 4. Prepare data using one-hot encoding in pandas.
- 7. Analyze data in pandas.
- 8. Design *dataframes* in pandas.


## Index:

- [Question 1](#Question-1)
- [Question 2](#Question-2)
- [Question 3](#Question-3)
- [Question 4](#Question-4)
- [Question 5](#Question-5)
- [Question 6](#Question-6)
- [Question 7](#Question-7)
- [Question 8](#Question-8)
- [Question 9](#Question-9)
- [Question 10](#Question-10)
- [Question 11](#Question-11)
- [Question 12](#Question-12)
- [Question 13](#Question-13)
- [Question 14](#Question-14)
- [Question 15](#Question-15)
- [Question 16](#Question-16)
- [Question 17](#Question-17)

### Importing Pandas

Before you begin this activity, you need to import the *pandas library*.

Run the code cell below:

In [1]:
import pandas as pd
import numpy as np

## Question 1

*3 points*

Create a `pandas` *dataframe, `df,`* containing three columns named *`id, name,`* and *`last_name`* and the values listed in the table below:

| id | name  | last_name |
|----|-------|-----------|
| 1  | Peter | Homs      |
| 2  | James | Miller    |
| 3  | Mark  | Huldi     |

In [4]:
### GRADED
import pandas as pd

### YOUR SOLUTION HERE
df = None

### BEGIN SOLUTION
df = pd.DataFrame({"id": [1,2,3], "name": ["Peter", "James", "Mark"], "last_name": ["Homs", "Miller", "Huldi"]})
### END SOLUTION

## Question 2

*3 points*

Consider the *dataframe, `df,`* from Question 1. Select the column `name` and assign it to a variable called *`ans2a`*. 

What is the type of *`ans2a`*? Assign your result to *`ans2b.`*

In [5]:
### GRADED
### YOUR SOLUTION HERE
ans2a = None
ans2b = None

### BEGIN SOLUTION
ans2a = df["name"]
ans2b = type(ans2a)
### END SOLUTION

## Question 3

*5 points*

Consider the *dataframe, `df,`* from Question 1. Rename the first column to `Name` and the second one to `Last_Name`.

In [5]:
### GRADED
### YOUR SOLUTION HERE


### BEGIN SOLUTION
newcols = {"name": "Name","last_name": "Last_Name"}
df.rename(columns=newcols, inplace=True)
### END SOLUTION

## Question 4

*4 points*

Read the .csv file `"data.csv"` inside the `data` folder and assign it to a *dataframe* called *`df_4`*. 

Group by the column *`season`* and count how many times each feature appears in each season. Assign the solution to the *dataframe `df_4_grouped`*.

In [6]:
### GRADED
### YOUR SOLUTION HERE
df_4 = None
df_4_grouped = None

### BEGIN SOLUTION
df_4 = pd.read_csv("data/data.csv")
df_4_grouped = df_4.groupby("season").count()
### END SOLUTION

Run the code cell below to visualize the first five rows of your *dataframe*.

In [7]:
df_4.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,hour,year,month,weather_label
0,2011-01-01 00:00:00,1,0,0,1,9.843750,14.398438,81,0.0,3,13,16,0,2011,1,Clear
1,2011-01-01 01:00:00,1,0,0,1,9.023438,13.632812,80,0.0,8,32,40,1,2011,1,Clear
2,2011-01-01 02:00:00,1,0,0,1,9.023438,13.632812,80,0.0,5,27,32,2,2011,1,Clear
3,2011-01-01 03:00:00,1,0,0,1,9.843750,14.398438,75,0.0,3,10,13,3,2011,1,Clear
4,2011-01-01 04:00:00,1,0,0,1,9.843750,14.398438,75,0.0,0,1,1,4,2011,1,Clear

## Question 5

*5 points*

Consider the  *dataframe `df_4`* from Question 4.  Create a filter to get all the rows where the column `humidity` is less than or equal to 85. Assign the new *dataframe* to *`ans5a`*.

In [8]:
### GRADED
### YOUR SOLUTION HERE
ans5a = None

### BEGIN SOLUTION
ans5a= df_4[df_4["humidity"] <= 85]
### END SOLUTION

## Question 6

*4 points*

Consider the  *dataframe `df_4`* from Question 4. Create a filter to get all the rows where the column `atemp` is greater than or equal to 15. Assign this new *dataframe* to *`ans6a`*.

In [9]:
### GRADED
### YOUR SOLUTION HERE
ans6 = None
### BEGIN SOLUTION
ans6a = df_4[df_4["atemp"] >= 15]
### END SOLUTION

## Question 7

*5 points*

Consider the *dataframe `df_4`*. Compute the average of the column *`windspeed`* and assign the value to the variable *`ans7a`*.

**HINT:** For this question, use the *function [mean()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mean.html).*

In [11]:
### GRADED
### YOUR SOLUTION HERE
ans7a = None

### BEGIN SOLUTION
ans7a = df_4["windspeed"].mean()
### END SOLUTION

## Question 8

*6 points*

Create a *pandas dataframe, `df_8`*, containing five columns named `name, age, gender, state, and num_pets` and the following values:

| name | age| gender|state|num_pets |
|------|----|-------|-----|---------|
| john | 23 | M     |california|5|
| mary | 78 | F     |dc|1|
| peter| 22 | M     |california|0|
|jeff  |19  | M     |dc|5|
|bill  |45  | M     |dc|2|
|lisa  |33  | NaN     |california|2|
|jose|20|M|texas|3

You can use the provided lists to avoid typing errors. 

Next, sort the column age in descending order and assign it to a variable called *`ans8a`*.

**HINT:** Use the *function [sort_values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values)*.

In [2]:
name = ['john','mary','peter','jeff','bill','lisa','jose']
age = [23,78,22,np.NaN,45,33,20]
gender = ['M','F','M','M','M',np.NaN,'M']
state = ['california','dc','california','dc','dc','california','texas']
num_pets = [5,1,0,5,2,2,3]

### YOUR SOLUTION HERE
df_8 = None
ans8a = None

### BEGIN SOLUTION
df_8 = pd.DataFrame({
 'name': name,
 'age': age,
 'gender': gender,
 'state': state,
 'num_pets':num_pets
})

ans8a = df_8.sort_values('age', ascending=False)
### END SOLUTION

## Question 9

*6 points*

Remove the duplicates from the column *`state`* in *`df_8`* and assign the result to a new *dataframe* called *`ans9a`*.

**HINT:** Use the *function [drop_duplicates](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html?highlight=drop_duplicates#pandas.DataFrame.drop_duplicates)*.

In [13]:
### GRADED
### YOUR SOLUTION HERE
ans9a = None

### BEGIN SOLUTION
ans9a = df_8.drop_duplicates("state")
### END SOLUTION

## Question 10

*6 points*

Remove all the missing values in *`df_8`* and assign the result to a new *dataframe* called *`ans10a`*.

In [14]:
### GRADED
### YOUR SOLUTION HERE
ans10a = None

### BEGIN SOLUTION
ans10a = df_8.dropna()
### END SOLUTION

## Question 11

*5 points*

What day of the week was October 24, 1990? Assign your answer as a *string* to *`ans11a`*.

In [15]:
### GRADED


### YOUR SOLUTION HERE
ans11a = None

### BEGIN SOLUTION
ans11a = pd.Series([1,2,3,4,5,6,7])
ans11a.index = pd.date_range(start = '24/10/1990', periods = 7)
ans11a.index.dayofweek
ans11a = 'Wednesday'
### END SOLUTION

## Question 12

*5 points*

Use the *method* [is_leap_year](https://pandas.pydata.org/docs/reference/api/pandas.DatetimeIndex.is_leap_year.html) to check whether 2000 was a leap year. Assign your answer to *`ans12a.`*

In [16]:
### GRADED


### YOUR SOLUTION HERE
ans12a = None

### BEGIN SOLUTION
ans12a = pd.date_range("1999-01-01", "2001-01-01", freq="Y")
ans12a = ans12a.is_leap_year[1]
### END SOLUTION

## The Athletes Events Dataset

In the next few questions, you will utilize the datasets `athlete_events.csv` and `regions.csv`.

The datasets used throughout this activity are saved inside the folder `/data`.

More information about this dataset can be found on Kaggle at this link:

https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results
    
**References:**
Rgriffin. (2018). “120 years of Olympic history: athletes and results.” Accessed July 15, 2021. 
https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results .

Run the code cell below to load the datasets in `pandas`.

In [22]:
df_athletes = pd.read_csv("data/athlete_events.csv")
df_regions = pd.read_csv("data/noc_regions.csv")

Run the code cells below to visualize the first few rows in your *dataframe*.

In [23]:
df_athletes.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [24]:
df_regions.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

### Question 13
*10 points*

Select all the rows from the *dataframe, `df_athlets`,* where `Year` is greater than 1980. Assign this *dataframe* to *`ans13a`*.

Next, select all the rows in *`ans13a`* where `Team` is equal to `China`, `United States`, `Italy`, or `Spain`. Save your results in a *dataframe* called *`ans13b`*.

**HINT**: To select only the desired countries, create a *list* containing the countries and use the *function* `isin` as follows:

```Python
df.Team.isin([list_with_countries])
```

In [27]:
### GRADED

### YOUR SOLUTION HERE
ans13a = None
ans13b = None

### BEGIN SOLUTION
ans13a = df_athletes.loc[df_athletes.Year > 1980]
ans13b = ans13a.loc[ans13a.Team.isin(["China", "United States", "Italy", "Spain"])]
### END SOLUTION

## Question 14
*8 points*
    
Use a left *join* to combine the *dataframes `df_athlets`* and *`df_regions`* into a new *dataframe* called *`ans14a`*. Set the column `NOC` as the key column.

In [28]:
### GRADED

### YOUR SOLUTION HERE
ans14a = None

### BEGIN SOLUTION
ans14a = pd.merge(df_athletes, df_regions, on='NOC', how='left')
### END SOLUTION

## Question 15
*6 points*

*Pivot* the *dataframe `df_regions`*  by setting:

- index = `region`
- columns = `NOC`
- values = `notes`

Assign the new *dataframe* to *`ans15a`*.

In [29]:
### GRADED

### YOUR SOLUTION HERE

### BEGIN SOLUTION
ans15a = df_regions.pivot(index = 'region', columns = 'NOC', values = 'notes')
### END SOLUTION

## Question 16
*7 points*

Group the entries of the *dataframe `df_athlets`* by the columns `"Season"` and `"Medal"`. Assign the new *dataframe* to *`ans16a`*.

Answer the following question: 

In which Olympic games did the first group of athletes participate?
- a) 2014 Winter
- b) 1920 Summer
- c) 1994 Summer
- d) 1920 Winter

Assign the letter of the correct answer as a *string* to *`ans16b`*.

For instance, if you believe the correct answer is *a) 2014 Winter*, your answer would be *`ans16b = 'a'`*.

In [30]:
### GRADED

### YOUR SOLUTION HERE
ans16a = None
ans16b =  None

### BEGIN SOLUTION
ans16a = df_athletes.groupby(["Season", "Medal"])
ans16a.first()
ans16b= 'b'
### END SOLUTION

### Question 17
*7 points*

Perform the following aggregation operations on *`df_athlets`*:

- Compute the `max` and the `min` on the column *`Age`*.
- Compute the `mean` on the column *`Weight`*.

Assign the new *dataframe* to *`ans17a`*.

**HINT:** Use the *function [aggregate()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html)* with the following syntax:

```Python

df.aggregate({first_column:['max', 'min'], second_column:['mean']})

```

In [31]:
### GRADED

### YOUR SOLUTION HERE
ans17a = None

### BEGIN SOLUTION
ans17a = df_athletes.aggregate({ "Age":['max', 'min'], 
              "Weight":['mean']}) 
### END SOLUTION